[{
        "title": "TEOTFW is a f***ing masterpiece",
        "content": "> \"People can't be answers. They're just more questions.\"\n\nI usually don't get this obsessed with a lot of shows. The show has to bend the film making rules really badly for it to be eligible to hit the spot. The End of the F***ing World is one of those shows. \n\nI love it, not because it's relatable or that I resonate with the themes that are highlighted in the series but because I genuinely think it's one of the best shows objectively. It has the right amount of experimentation done in the right way. It's an experience and it's done better in this medium (as opposed to the book). There's no centralised message (or not one that I could gather) but a string of realisations throughout the show that makes you feel like you've actually learnt something. \n\nA lot of stuff happens in a very short time. Everything in this show is rushed but that is not necessarily a bad thing. The fact that the show treats big plot twists as ordinary story devices is a good thing in its own way. You never get disappointed and the show has to do an even better job to top what had already been the best scene till that point. \n\nThe storytelling is done right. The colours are beautiful. The jump cuts make sense. It really feels like a lot of work was done before actually releasing it. The comedy is done right visually as well as narratively.\n\nThis show goes on for just about 2 hours 40 minutes, the average size of a film split into 8 episodes (which is a unique decision as well) and shows it in a way that is so creatively unique and aesthetic. The show starts almost like a satire. That's what I thought in the beginning and I'm pretty sure the book was intended to be a satire too (I haven't read the book yet) but on completing season 1, it became apparent how the inhumane nature of the characters at the beginning of the series was just \"teenagers being teenagers\" and to make the end character development even more interesting and drastic while being accurate.\n\n- Spoiler Alert\n\n    James, an introvert who has shut his feelings off ever since his mom committed suicide in front of him and Alyssa, an extrovert who never really got the attention from both her parents from a very young age. Her dad left her and her mom was too caught up with bringing her life together. \n\nThe soundtrack is indescribable. It matches the tone of the show perfectly. I watched the show around 2 years back and I still listen to the soundtrack to this day. I think it's genius how they use calm songs during morbid scenes. It really confuses the audience and bends our perspective on how we perceive a particular scene. You're confused if you should be sickened by the gore they're showing in the frame or if you should enjoy the song playing in the background. \n\nThe episodic nature allows there to be cliffhangers even if the total story is the size of one movie. There are so many 4th wall breaks and foreshadowing which just goes on to show how this is nothing like the typical Netflix cliches. The costumes are very well done as well. (Especially Alyssa's wedding dress and James's funeral clothes in S2. The contrasting effect is prevalent here too!)\n\nThe characters are likable and their behaviour seems justified even if it's erratic. The actors did a wonderful job playing teenagers while actually being almost a decade older their characters.\n\nAll in all, I'm very glad that this show turned out like how it is right now. No one could have done it better. The more I say about this series, the more I feel like I'm not appreciating it enough. I say my thanks to the directors, writers, producers, actors, art directors, cinematographers, casting directors, costume designers and everyone who made this show a reality.",
        "publishedDate": "01-07-2021",
        "tag": "Film",
        "id": "teotfw",
        "description": "\"People can't be answers. They're just more questions.\"",
        "bgColor": "#6D1B10",
        "color": "#E1C790"
    },
    {
        "title": "CoDiff",
        "content": "CoDiff is a VSCode extension that has live access to all your teammates' local changes, greatly improving communication: it notifies you of conflicts with teammates as they occur. Download the extension from [here](https://marketplace.visualstudio.com/items?itemName=bar9.codiff).\n\n## Features\n- Use your GitHub account to log in.\n- Start conflict detection on any git initialized repository.\n- Get notified when another user saves the same file that you are working on.\n- Whenever you save a particular file you will be notified if you conflict with a previously saved local version.\n- View conflicts between your version and the saved version of one of the collaborators.\n- Receive notification asking you to pull changes if your local version is behind some commits compared to the one on GitHub.\n- Access the sidebar from where you can start conflict detection and view other details regarding the room you are in which includes the room ID, git repo url, branch and revision ID.\n\n## Screenshots\n![](https://media.discordapp.net/attachments/706928005313855620/846836626683330570/unknown.png?width=379&height=90)\n\nConflict notification\n\n![](https://media.discordapp.net/attachments/706928005313855620/846837133045792776/unknown.png?width=363&height=34)\n\nFile saving notification\n\n![](https://media.discordapp.net/attachments/706928005313855620/846837601574060032/unknown.png?width=641&height=350)\n\nViewing conflicts",
        "publishedDate": "28-05-2021",
        "tag": "Code",
        "id": "codiff",
        "description": "This was a freelancing project for Roland Brand on which me and <a target=\"_blank\" href=\"https://anshulsaha.me\">Anshul</a> worked on for over 2 months. The difficult part was understaning the functioning of scm extensions.",
        "bgColor": "#293A4A",
        "color": "#9BE294"
    },
    {
        "title": "COVICoin",
        "content": "COVICoin was made during a hackathon in 48 hours. A working version is hosted [here](https://covicoin.herokuapp.com). \n ## Problem\n\n> With India’s coronavirus crisis becoming increasingly more desperate and beds, medicine, and oxygen supplies scarce, people in cities across the country are relying on Twitter and the kindness of strangers for help during a time of national upheaval.\n\nThe above extract is from [this](https://www.washingtonpost.com/world/2021/04/28/india-coronavirus-social-media-help/) article by the Washington Post about how the COVID crisis in India is growing out of proportion resulting in a shortage of resources and communication gaps between the suppliers and the people in need. All of this is resulting in people tweeting asking about the availability of oxygen cylinders and other medical care resources in their area. \n\nThe problem is that many of these tweets don't get 100+ retweets or likes and are hence not being noticed by people who have resources or leads. Many of these tweets are being ignored for hours and hours without getting even a single reply. \n\nThis is demoralizing for the person who posted the tweet and is directly or indirectly hurting the person who the resources are being asked for. \n\n## Solution\n\nSeeing how in this lockdown, everyone is working/studying from home and are able to spare a minimum of 1-2 hours per day for leisure activities, we decided to put their idle time to use to solve the above-mentioned problem.   \n\nOur solution is a gamified experience that gives the user redeemable credits based on how many people they help. The system shows the users specific tweets which are asking for leads about COVID resources and the users get redeemable credits according to how much they can help the person by verifying leads and replying to that tweet.\n\n## Flow\n\n1. User signs in with twitter account\n2. User's username and auth token is stored\n3. The user then is supposed to read the starting instructions\n4. The user can then press the  \"start session\" button to start the session.\n5. A session consists of tweets that will be shown to the user one at a time. \n6. These tweets which will be shown will be ones asking for covid resources and would be the latest ones since we would be streaming them in real-time.\n7. There will be buttons on the screen along with the embedded tweet. Those buttons will be \"skip\" or \"help\". \n8. If the user presses \"skip\" then the next tweet appears on the screen. \n9. But if the user presses the \"help\" button then: \n    1.  A **templated** message with fillable blanks would be provided to the users in which they have to enter specific information regarding whatever lead they have. \n    2. Here's the template we are going to provide:\n        - **Tweet Reply Template**\n\n            Here's a lead for <thing> in <place>\n            Location: <place>\n            Quantity: <quantity>\n            Contact Name: <contact name (optional)>\n            Contact Number: <number1>, <number2>\n\n    3. All of this information would be required for them to put in their reply to earn COVICoins.\n    4. If they decide not to reply in the template then a lesser amount of COVICoins would be earned. \n    5. Once they have replied, they need to press the \"verify reply\" button which will send a request to the API which will check the authenticity of the reply. If the reply is authentic and has all the required information then the system adds the earned COVICoins to the user's account.\n\n    Here's how we are going to verify their tweets:\n\n    - **Verification System**\n\n        There are two ways by which a user can send leads:\n\n        1. They find the lead on twitter itself and verify it by calling.\n        2. They find the lead locally.\n\n        There are going to be two tests:\n\n        **Test 1**\n\n        We first reverse search the information they provide on Twitter to check if it's a valid lead. If we find that the original tweet has been made within 30 minutes and has all the correct information, we approve this test. If we don't find tweets by reverse searching, we store the information in our database for further verification.\n\n        **Test 2**\n\n        We ask the users to upload a screenshot of their call history. We verify it by confirming all the details and checking if the lead confirmation call did actually take place.\n\n        Note that we'll give the user the full COVICoin only if they pass both the tests.\n\n    Here's how we are going to prevent spam:\n\n    - **Spam Prevention System**\n\n        **CAPTCHA**\n\n        CAPTCHA on every form so bots can't be used to automate the procedure and procuring free money.\n\n        **Reducing the redundancy of leads**\n\n        We ensure that the user doesn't use the same lead more than 2 times. The test fails if the user has already used the lead 2 times before\n\n        **Banning system**\n\n        We'll be manually checking the screenshots the users upload. If we find that a user is uploading fake screenshots, we'll ban them from the website. They will lose all their COVICoins and won't be able to use the account in the future. After the initial launch, we plan to automate this by making a machine learning model.\n\n10. The user can end the session at any time by clicking the \"end session\" button. \n11. There's a limit to the number of tweets they can reply to earn COVICoins. That limit would be set to 20 tweets when we launch the website.\n12. The user can redeem the COVICoins only when there are more than 500 COVICoins in their account. The redemption process will be through the website only.\n\n## COVICoin Guidelines\n\nConversion Rate ⇒  **1 COVICoin** = **0.5 INR**\n\nEach templated reply will give the user **1 COVICoin**\n\nEach reply which is authentic but not templated will give the user **0.5 COVICoin**\n\nEach reply which is not authentic will give **0 COVICoin** to the user.",
        "publishedDate": "17-05-2021",
        "tag": "Code",
        "id": "covicoin",
        "description": "This project won the 2nd prize at <a target=\"_blank\" href=\"http://frosthack.com\">FrostHack 2021</a> organized by Indian Institute of Technology, Mandi. I built this with my team members <a target=\"_blank\" href=\"https://anshulsaha.me\">Anshul</a> (backend) and <a target=\"_blank\" href=\"https://behance.net/samvrant\">Samvrant</a> (designer).",
        "bgColor": "rgba(193, 245, 154)",
        "color": "#304A1C"
    },
    {
        "title": "Direct Messages for VSCode",
        "content": "Direct Messages is a simple way of messaging your developer friends and collaborating with them through VS Code.\n\n<img src=\"https://cdn.discordapp.com/attachments/767769692001402910/783426486521823292/unknown.png\"/>\n\nFollow up on the realtime chat demo videos [here](https://youtu.be/bDRIVyh4O7Y) and [here](https://youtu.be/CcZATcyTWE0).\n\n## Features\n\n- Quickly sign-in through your GitHub account to get started.\n- The extension fetches all your mutual contacts from GitHub to whom you can message right away.\n- Know when your friends are online by simply checking their status.\n- Share screenshots of bugs, features, or anything you wish by pasting the image in the chatbox.\n- Share code snippets to your most recent conversation in one click.<br/><br/>\n  <img src=\"https://cdn.discordapp.com/attachments/767769692001402910/783423730247401503/unknown.png\"/>\n\n- Create Group DMs (max 5 people) to collaborate and work in sync together on a project.\n- Customize your notification settings by clicking on the notification icon of respective chats.\n\n### Media\n\nA complete gallery of all the working processes of the extension can be found [here](https://imgur.com/a/oJTM9L2).\n\n## Getting Started\n\n1. Install the extension from [here](https://marketplace.visualstudio.com/items?itemName=techsyndicate.vscode-dms) or search for it on the VS Code marketplace.\n2. Once you have it, you'll need to login through GitHub to start messaging.\n3. On completing the authentication, you can click on the Direct Messages icon on the sidebar, and it will load all of your mutual contacts from GitHub. \n 4. And that's it. You're now ready to start messaging!\n\n[Here](https://youtu.be/NzZ23GLetQc) is the installation tutorial if you prefer things that way.",
        "publishedDate": "30-12-2020",
        "tag": "Code",
        "id": "vscdms",
        "description": "Yes. We were inspired by Ben Awad.",
        "bgColor": "rgba(213, 161, 247)",
        "color": "#743E97"
    }
]